[
    {
        "id": 1,
        "title": "Building a Roofing Website That Actually Produces Calls",
        "content": "This project was not about making a prettier website. It was about building a system that search engines trust, homeowners believe, and that reliably turns searches into phone calls and inspections over time.",
        "bullets": [
            "What was built",
            "Why it was built this way",
            "Why this approach works better than traditional SEO"
        ],
        "footer": "Presented by C&L Strategy"
    },
    {
        "id": 2,
        "title": "The Real Problem With Traditional SEO",
        "content": "Most SEO fails because it focuses on activity instead of outcomes. Traditional SEO usually means blog posts every month, keyword rankings reports, and vague 'optimizations'.",
        "bullets": [
            "Feels untrustworthy",
            "Answers the wrong question",
            "Fails to convert"
        ]
    },
    {
        "id": 3,
        "title": "Our Core Philosophy",
        "content": "We don’t treat SEO as content. We treat it as infrastructure. Infrastructure follows rules, scales safely, compounds over time, and does not break when you add to it.",
        "emphasis": "Instead of guessing what Google wants this month, we built a system that aligns with how search engines and AI systems evaluate businesses today."
    },
    {
        "id": 4,
        "title": "Why We Started With Structure",
        "content": "Search engines ask very basic questions first. Most agencies skip this and start writing content. We locked structure and rules first so nothing had to be redone later.",
        "bullets": [
            "Is this a real business?",
            "Is it clearly located?",
            "Is it organized logically?",
            "Does it solve a specific problem?"
        ]
    },
    {
        "id": 5,
        "title": "What Makes This Site Different",
        "content": "This site was designed to do four things at the same time: Rank for high-intent searches, Feel trustworthy immediately, Convert mobile users quickly, and Scale safely without penalties.",
        "emphasis": "Doing all four requires planning, not guesswork."
    },
    {
        "id": 6,
        "title": "The Foundation: Core Pages First",
        "content": "Before scaling anything, we built a complete, credible business website: homepage, service pages, location page, about and contact.",
        "bullets": [
            "Search engines trust complete businesses.",
            "Homeowners trust businesses that clearly explain what happens next."
        ]
    },
    {
        "id": 7,
        "title": "What Programmatic SEO (pSEO) Actually Is",
        "content": "Programmatic SEO means using one proven structure to safely create many pages. Instead of writing random pages, we created one strong service template and one strong location template.",
        "emphasis": "This is scale without spam."
    },
    {
        "id": 8,
        "title": "Why pSEO Works For Roofing",
        "content": "Roofing customers search very specifically: roof repair in a specific city, storm damage near them, roof inspection close by. pSEO allows coverage of multiple cities and services without sacrificing quality.",
        "emphasis": "If your website doesn’t match those searches exactly, competitors will."
    },
    {
        "id": 9,
        "title": "Why Most Agencies Get pSEO Wrong",
        "content": "Bad pSEO looks like thin pages, copy-pasted junk, and city names stuffed into paragraphs. We avoided this by reusing high-quality templates and controlling rollout.",
        "bullets": [
            "Reusing high-quality templates",
            "Controlling rollout",
            "Delaying indexing",
            "Linking pages together intentionally"
        ]
    },
    {
        "id": 10,
        "title": "What AEO (Answer Engine Optimization) Is",
        "content": "People no longer only search Google. They ask Siri, Alexa, Google AI, and ChatGPT. These systems don’t show ten links. They show one answer.",
        "emphasis": "AEO means building pages so your business becomes that answer."
    },
    {
        "id": 11,
        "title": "How AEO Was Used For Your Site",
        "content": "We created pages that answer real homeowner questions about cost, longevity, and insurance. Each page answers immediately, uses neutral language, and builds trust.",
        "emphasis": "This positions the business as an authority, not a salesman."
    },
    {
        "id": 12,
        "title": "Why AEO Matters Going Forward",
        "content": "Search is shifting toward fewer clicks and more AI-generated summaries. If a business is not structured to be understood by AI, it slowly loses visibility.",
        "emphasis": "AEO future-proofs your presence as search evolves."
    },
    {
        "id": 13,
        "title": "Conversion Was Designed In",
        "content": "We assumed most visitors are on phones, want reassurance, and want to call quickly. Traffic only matters if it turns into calls.",
        "bullets": [
            "Prioritized click-to-call",
            "Calls visible at all times",
            "Removed friction"
        ]
    },
    {
        "id": 14,
        "title": "Trust Signals (Without the BS)",
        "content": "Roofing is a trust-based decision. We added credibility through clear service area definition and licensed/insured language. Honesty converts better long-term.",
        "emphasis": "We intentionally avoided fake testimonials and exaggerated claims."
    },
    {
        "id": 15,
        "title": "Local Dominance Signals",
        "content": "Google needs clarity on where you are based, who you serve, and why you belong in local results.",
        "bullets": [
            "Tomball as the headquarters",
            "Greater Houston as the service area",
            "Local storm and weather context"
        ]
    },
    {
        "id": 16,
        "title": "Why This System Compounds",
        "content": "Every page added strengthens the entire site, feeds authority inward, and improves future rankings. This builds momentum over time.",
        "emphasis": "This is not a reset-every-month SEO plan."
    },
    {
        "id": 17,
        "title": "What We Intentionally Did Not Do",
        "content": "We avoided shortcuts like backlink schemes, citation spam, and content mills. These produce short-term spikes and long-term damage.",
        "emphasis": "This approach is slower upfront and stronger over time."
    },
    {
        "id": 18,
        "title": "What Success Looks Like",
        "content": "Success evolves from early visibility to long-term defensible dominance.",
        "bullets": [
            "Early: Clean indexing, impressions increasing",
            "Mid: City-level visibility, local pack presence",
            "Long: Steady inbound calls, less reliance on ads"
        ]
    },
    {
        "id": 19,
        "title": "Why C&L Strategy Is Different",
        "content": "We don’t sell SEO tasks. We build systems, infrastructure, and long-term advantage.",
        "emphasis": "That’s why the work looks deliberate — and why it lasts."
    },
    {
        "id": 20,
        "title": "Where This Goes Next",
        "content": "Now that the foundation is built, we let it mature, expand carefully, and protect what works.",
        "emphasis": "This is how you win search long-term."
    }
]